OpenFOAM-v2506/modules/OpenQBMM/tutorials/diluteVdfTransportFoam/rotatingCylinder/0/U.fluid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type    rotatingWallVelocity;
        origin  (0 0 0);
        axis    (0 0 1);
        omega   5;
    }
    defaultFaces
    {
        type    empty;
    }
}


// ************************************************************************* //
